uhnp/src/Reports/ПлатежныйКалендарьУХ/ПлатежныйКалендарьУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПлатежныйКалендарьУХ</name>
  <comment>(-УХ)</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтбора</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяВерсияПлатежногоКалендаря</name>
    <type>
      <types>CatalogRef.СохраненныеВерсииПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтображения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОстаткиСУчетомОвердрафтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПоступленияПередСписаниями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СворачиватьНеуправляемыеСписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоПриоритету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоПриоритетуПоУбыванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоСумме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоСуммеПоУбыванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоДнейОперативногоПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаОтображенияПросроченныхПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СценарийСтрессТестированияЛиквидности</name>
    <type>
      <types>CatalogRef.СценарииСтрессТестированияЛиквидности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДиаграмму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОбороты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтОперативногоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаТаблицыОстатковИОборотов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМакетаОформления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОтбораПросроченныхЗаявок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПереводаМеждуСчетами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКомиссииПриКонвертацииВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СущественнаяРазницаСтоимостиКредитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДанныеВВалютеОтображения</name>
    <comment>Выводить данные календаря в валюте отображения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкиОтчета</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтТактическогоПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОперативногоПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьТолькоКассовыеРазрывы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПлатежногоКалендаря</name>
    <type>
      <types>EnumRef.ВариантыПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВходящихОстатков</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСобытияФормированияОтчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыводаОборотов</name>
    <type>
      <types>EnumRef.РежимыВыводаОборотовПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаАнализаЭкстраполяцииДенежныхПотоков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДолгосрочногоПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтДолгосрочногоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаДанныхДоговоров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДоверительныеКоэффициентыПриПланированииПоступлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБазоваяФункциональность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПлановыеКурсы</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицаВесовЛиквидности</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>EnumRef.ИсточникиДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоризонтПланированияЛиквидности</name>
      <type>
        <types>EnumRef.ГоризонтыПланированияЛиквидности</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>DefinedType.ВесИсточникаДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаВариантовОптимизации</name>
    <attributes>
      <name>ВариантОптимизации</name>
      <type>
        <types>EnumRef.ВариантыОптимизацииПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

uhnp/src/InformationRegisters/ПредставлениеПлатежногоКалендаря/ПредставлениеПлатежногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредставлениеПлатежногоКалендаря</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторОтменившейОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайняяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированныйБанковскийСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>EnumRef.ИсточникиДанныхПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>Оптимизация</name>
    <comment>Операция добавлена в ходе оптимизации календаря</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияПлатежногоКалендаря</name>
    <type>
      <types>CatalogRef.СохраненныеВерсииПлатежногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПулЛиквидности</name>
    <type>
      <types>CatalogRef.ПулыЛиквидности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>DefinedType.Банк</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>DefinedType.БанковскийСчетКасса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделПлатежногоКалендаря</name>
    <type>
      <types>EnumRef.РазделыПлатежногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инструмент</name>
    <type>
      <types>DefinedType.ИнструментыПлатежногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторДобавившейОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДенежныхСредств</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Reports/ПлатежныйКалендарьУХ/Forms/ФормаРазделенияОперации/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ДанныеЗаполнения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредставлениеПлатежногоКалендаря.Организация КАК Организация,
	|	ПредставлениеПлатежногоКалендаря.Валюта КАК Валюта,
	|	ПредставлениеПлатежногоКалендаря.Дата КАК Дата,
	|	ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	СУММА(ВЫБОР
	|			КОГДА ПредставлениеПлатежногоКалендаря.Сумма > 0
	|				ТОГДА ПредставлениеПлатежногоКалендаря.Сумма
	|			ИНАЧЕ -ПредставлениеПлатежногоКалендаря.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ПредставлениеПлатежногоКалендаря.Сумма) < 0 КАК ЭтоРасход
	|ИЗ
	|	РегистрСведений.ПредставлениеПлатежногоКалендаря КАК ПредставлениеПлатежногоКалендаря
	|ГДЕ
	|	ПредставлениеПлатежногоКалендаря.ИдентификаторЗаписи = &ИдентификаторЗаписи
	|	И ПредставлениеПлатежногоКалендаря.Пользователь = &Пользователь
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредставлениеПлатежногоКалендаря.Организация,
	|	ПредставлениеПлатежногоКалендаря.Валюта,
	|	ПредставлениеПлатежногоКалендаря.Дата,
	|	ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса";
	Запрос.УстановитьПараметр("ИдентификаторЗаписи", 	Параметры.ДанныеЗаполнения.ИдентификаторЗаписи);
	Запрос.УстановитьПараметр("Пользователь", 			Параметры.ДанныеЗаполнения.Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
	СформироватьНадписьИсходнаяОперация();
	УстановитьУсловноеОформление();	
	РаспределитьПропорционально(2);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРазделить(Команда)
	
	Если ОстатокКРаспределению <> 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Сумма распределения должна совпадать с суммой исходной операции'"));
		Возврат;
	КонецЕсли;
	
	Результат = Новый Массив;
	Для Каждого ТекСтр Из Распределение Цикл
		Результат.Добавить(ТекСтр.Сумма * ?(ЭтоРасход, -1, 1));
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПриИзменении(Элемент)
	
	ОбновитьИтогиРаспределения(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтогиРаспределения(Форма)
	
	ТаблицаРаспределение = Форма.Распределение;
	
	Форма.Распределено = ТаблицаРаспределение.Итог("Сумма");
	Форма.ОстатокКРаспределению = Форма.Сумма - Форма.Распределено;
	
	Если Форма.ОстатокКРаспределению <> 0 Тогда
		
		Если Не ТаблицаРаспределение.Количество() Тогда
			НоваяСтрока = ТаблицаРаспределение.Добавить();
		КонецЕсли;
		
		ПоследняяСтрока = ТаблицаРаспределение[ТаблицаРаспределение.Количество() - 1];
		Если (Форма.ОстатокКРаспределению + ПоследняяСтрока.Сумма) > 0 Тогда
			ПоследняяСтрока.Сумма = Форма.ОстатокКРаспределению + ПоследняяСтрока.Сумма;
			Форма.Распределено = Форма.Сумма;
			Форма.ОстатокКРаспределению = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПропорционально(Знач КоличествоЧастей)
	
	Если КоличествоЧастей = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Распределение.Очистить();
	
	ОднаЧасть = Окр(Сумма / КоличествоЧастей, 2);
	Остаток = Сумма - (ОднаЧасть * (КоличествоЧастей-1));
	
	Для Сч = 1 По (КоличествоЧастей - 1) Цикл
		НовСтрока = Распределение.Добавить();
		НовСтрока.Сумма = ОднаЧасть;
	КонецЦикла;
	
	НовСтрока = Распределение.Добавить();
	НовСтрока.Сумма = Остаток;
	
	ОбновитьИтогиРаспределения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспределитьНа2(Команда)
	РаспределитьПропорционально(2);
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспределитьНа3(Команда)
	РаспределитьПропорционально(3);
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспределитьНаN(Команда)
	РаспределитьПропорционально(Распределение.Количество());
КонецПроцедуры

&НаСервере
Процедура СформироватьНадписьИсходнаяОперация()
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(?(ЭтоРасход, НСтр("ru = 'Списание'"), НСтр("ru = 'Зачисление'")));
	МассивСтрок.Добавить("<b>" + Строка(Сумма));
	МассивСтрок.Добавить(Строка(Валюта) + "</b>");
	МассивСтрок.Добавить(НСтр("ru = 'в дату'"));
	МассивСтрок.Добавить("<b>" + Формат(Дата, "ДЛФ=D") + "</b>");
	МассивСтрок.Добавить(?(ЭтоРасход, НСтр("ru = 'со счета'"), НСтр("ru = 'на счет'")));
	МассивСтрок.Добавить("<b>" + Строка(БанковскийСчетКасса) + "</b>");
	
	НадписьИсходнаяОперация = СтроковыеФункцииКлиентСервер.ФорматированнаяСтрока(СтрСоединить(МассивСтрок, " "));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОстатокКРаспределению.Имя);

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОстатокКРаспределению", ВидСравненияКомпоновкиДанных.Заполнено);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);
	
КонецПроцедуры

#КонецОбласти
